Ran Plan for dir: `infra/gcp/terraform/kubernetes-public` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_pubsub_subscription.kettle_subscription has been deleted
- resource "google_pubsub_subscription" "kettle_subscription" {
        id                           = "projects/kubernetes-public/subscriptions/k8s-infra-kettle-staging"
      - name                         = "k8s-infra-kettle-staging" -> null
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # google_container_cluster.cluster will be updated in-place
~ resource "google_container_cluster" "cluster" {
        id                                       = "aaa"
        name                                     = "aaa"
        # (36 unchanged attributes hidden)

      ~ cluster_autoscaling {
            # (3 unchanged attributes hidden)

          ~ auto_provisioning_defaults {
                # (7 unchanged attributes hidden)

              - shielded_instance_config {
                  - enable_integrity_monitoring = false -> null
                  - enable_secure_boot          = false -> null
                }

                # (2 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (30 unchanged blocks hidden)
    }

  # google_pubsub_subscription.kettle_subscription will be created
+ resource "google_pubsub_subscription" "kettle_subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + filter                     = "attributes.eventType = \"OBJECT_FINALIZE\""
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "k8s-infra-kettle-staging"
      + project                    = "kubernetes-public"
      + terraform_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + topic                      = "k8s-infra-kubernetes-jenkins-changes"

      + expiration_policy (known after apply)
    }

  # google_pubsub_subscription_iam_binding.subscription_binding will be created
+ resource "google_pubsub_subscription_iam_binding" "subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + members      = [
          + "serviceAccount:kettle@kubernetes-public.iam.gserviceaccount.com",
        ]
      + project      = "kubernetes-public"
      + role         = "roles/pubsub.editor"
      + subscription = "k8s-infra-kettle-staging"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/gcp/terraform/kubernetes-public
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Fgcp%252Fterraform%252Fkubernetes-public%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/gcp/terraform/kubernetes-public
  ```

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```